<?php

use App\Publication;
use Illuminate\Database\Seeder;

class PublicationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Гудов А.М., Захаров Ю.А., Невзоров Б.П., Третьякова И.В.',
                'name' => 'Проблемы и типовые решения создания информационной инфраструктуры регионального образовательного комплекса.',
                'city' => 'Кемерово',
                'year' => '2001',
                'image' => 'publ.gif',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Гудов А.М.',
                'name' => 'Информационные технологии в численных расчетах.',
                'city' => 'Кемерово',
                'year' => '2001',
                'image' => 'itchr.gif',
                'file' => 'sb_nok_g.pdf',
            ]);
        Publication::create(
            [
                'author' => 'Гудов А.М., Шмакова Л.Е.',
                'name' => 'Введение в язык структурированных запросов SQL.',
                'city' => 'Кемерово',
                'year' => '2001',
                'image' => 'pl_sql.gif',
                'file' => 'sqlplus.pdf',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Стуколов С.В.',
                'name' => 'КМГЭ для решения плоских задач гидродинамики и его реализация на параллельных компьютерах.',
                'city' => 'Кемерово',
                'year' => '2001',
                'image' => 'kmge.gif',
                'file' => 'kniga.pdf',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Стуколов С.В.',
                'name' => 'Многопроцессорные вычислительные системы и параллельное программирование.',
                'city' => 'Кемерово',
                'year' => '2003',
                'image' => 'paral.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Шмакова Л.Е.',
                'name' => 'Компьютерная обработка информации.',
                'city' => 'Кемерово',
                'year' => '2005',
                'image' => 'comp_obrab.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Овчинников А.В., Овчинникова Г.С., Макарчук Р.С.',
                'name' => 'Элементы работы с библиотекой MFC и COM технологиями.',
                'city' => 'Кемерово',
                'year' => '2006',
                'image' => 'com_technologies.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Григорьева И.В.',
                'name' => 'Рекурсивно-логическое программирование на Visual Prolog.',
                'city' => 'Томск',
                'year' => '2008',
                'image' => 'rekurs_log_progr.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Гудов А.М., Завозкин С.Ю., Рейн Т.С.',
                'name' => 'Базы данных и системы управления базами данных. Программирование на языке PL/SQL.',
                'city' => 'Кемерово',
                'year' => '2010',
                'image' => 'pl_sql_titul.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Завозкин С.Ю., Трофимов С.Н., Власенко А.Ю.',
                'name' => 'Основы высокопроизводительных вычислений. Т.1.Высокопроизводительные вычислительные системы.',
                'city' => 'Кемерово',
                'year' => '2011',
                'image' => 'uch_posob_vvs.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Григорьева И.В., Рейн Т.С.',
                'name' => 'Основы высокопроизводительных вычислений. Т.3.Параллельные вычислительные алгоритмы.',
                'city' => 'Кемерово',
                'year' => '2012',
                'image' => 'vpv_tom3.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Стуколов С.В., Малышенко В.В., Карабцев С.Н., Андреев Н.Е.',
                'name' => 'Основы высокопроизводительных вычислений. Т.2.Технологии параллельного программирования; Изд. 2-е, переработанное.',
                'city' => 'Кемерово',
                'year' => '2013',
                'image' => 'vpv_tom2.jpg',
                'file' => '0',
            ]);
        Publication::create(
            [
                'author' => 'Афанасьев К.Е., Завозкин С.Ю., Трофимов С.Н., Власенко А.Ю.',
                'name' => 'Основы высокопроизводительных вычислений. Т.1.Высокопроизводительные вычислительные системы; Изд. 2-е, переработанное',
                'city' => 'Кемерово',
                'year' => '2013',
                'image' => 'vpv_tom1.jpg',
                'file' => '0',
            ]);
    }
}
